Revit 2024 API
RebarContainerItem.IsBarHidden Method
 Identifies if a given bar in this rebar set is hidden in this view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsBarHidden(
	View view,
	int barIndex
)
Visual Basic
Public Function IsBarHidden ( _
	view As View, _
	barIndex As Integer _
) As Boolean
Visual C++
public:
bool IsBarHidden(
	View^ view,
	int barIndex
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view.
barIndex
Type: System.Int32
 The index of the bar from this rebar set.
Return Value
 True if the bar is hidden in this view, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace